#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:cluster/main]
aws_eip.nat_1: Refreshing state... [id=eipalloc-087e85560a57799da]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
aws_service_discovery_http_namespace.interview_project: Refreshing state... [id=ns-os4u4zahbptsybf5]
aws_vpc.main: Refreshing state... [id=vpc-032a6f161e08d5410]
aws_eip.nat_2: Refreshing state... [id=eipalloc-0f02c45284c690413]
aws_efs_file_system.shared_storage: Refreshing state... [id=fs-0a7919a5db69e6ec1]
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=1077804475]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role]
aws_ecs_task_definition.reverse_proxy: Refreshing state... [id=reverse-proxy]
aws_subnet.wordpress_2: Refreshing state... [id=subnet-0d54284d694defe07]
aws_security_group.aurora_sg: Refreshing state... [id=sg-06a71fdee05a78ef5]
aws_subnet.reverse_proxy_2: Refreshing state... [id=subnet-0511ae2aca668cf8f]
aws_lb_target_group.reverse_proxy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/a05a7840a5705b81]
aws_security_group.alb_sg: Refreshing state... [id=sg-0a7d44cf9377799e9]
aws_subnet.public_1: Refreshing state... [id=subnet-0f6a148c411bedf0c]
aws_subnet.wordpress_1: Refreshing state... [id=subnet-0c87dfef08f53a968]
aws_internet_gateway.gw: Refreshing state... [id=igw-023fe470033102e53]
aws_subnet.public_2: Refreshing state... [id=subnet-03a57c292d204c5cf]
aws_subnet.reverse_proxy_1: Refreshing state... [id=subnet-092cf4c0e0d5d7cf2]
aws_security_group.efs_sg: Refreshing state... [id=sg-09ab3c76375a428d3]
aws_security_group.reverse_proxy_sg: Refreshing state... [id=sg-0156a366114c9977f]
aws_db_subnet_group.wordpress: Refreshing state... [id=wordpress]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-08d2d0d477d50ca06]
aws_nat_gateway.nat_2: Refreshing state... [id=nat-05510aad7cab7a912]
aws_security_group.wordpress_sg: Refreshing state... [id=sg-0dcc26775dcf052d6]
aws_efs_mount_target.az_1: Refreshing state... [id=fsmt-07588e0fa884a497e]
aws_efs_mount_target.az_2: Refreshing state... [id=fsmt-047b34464075e4242]
aws_lb.reverse_proxy_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:loadbalancer/app/reverse-proxy-alb/0ac6ea024f005fde]
aws_ecs_service.reverse_proxy_service: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:service/main/reverse-proxy-service]
aws_route_table.private_2: Refreshing state... [id=rtb-0e252afce1b70d9d0]
aws_route_table.private_1: Refreshing state... [id=rtb-0f9e94c38ab825a92]
aws_appautoscaling_target.reverse_proxy_scaling_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:816069151329:cluster/main/reverse-proxy-service]
aws_route_table_association.reverse_proxy_private_2: Refreshing state... [id=rtbassoc-0d7e63eba8c4b639d]
aws_route_table_association.wordpress_private_2: Refreshing state... [id=rtbassoc-02e5bb86671850afa]
aws_route_table_association.reverse_proxy_private_1: Refreshing state... [id=rtbassoc-0a2df505f51fc61d0]
aws_route_table_association.wordpress_private_1: Refreshing state... [id=rtbassoc-0434085205ad15f31]
aws_lb_listener.reverse_proxy_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:listener/app/reverse-proxy-alb/0ac6ea024f005fde/853c9c2ef06630b4]
aws_appautoscaling_policy.reverse_proxy_scale_up: Refreshing state... [id=reverse-proxy-scale-up]
aws_appautoscaling_policy.reverse_proxy_scale_down: Refreshing state... [id=reverse-proxy-scale-down]
aws_rds_cluster.wordpress: Refreshing state... [id=wordpress]
aws_ecs_task_definition.wordpress: Refreshing state... [id=wordpress]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appautoscaling_policy.wordpress_scale_down will be created
  + resource "aws_appautoscaling_policy" "wordpress_scale_down" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "wordpress-scale-down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_policy.wordpress_scale_up will be created
  + resource "aws_appautoscaling_policy" "wordpress_scale_up" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "wordpress-scale-up"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.wordpress_scaling_target will be created
  + resource "aws_appautoscaling_target" "wordpress_scaling_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # aws_ecs_service.reverse_proxy_service will be updated in-place
  ~ resource "aws_ecs_service" "reverse_proxy_service" {
      ~ desired_count                      = 2 -> 1
        id                                 = "arn:aws:ecs:us-east-1:816069151329:service/main/reverse-proxy-service"
        name                               = "reverse-proxy-service"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.wordpress will be created
  + resource "aws_ecs_service" "wordpress" {
      + cluster                            = "arn:aws:ecs:us-east-1:816069151329:cluster/main"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "wordpress-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:816069151329:task-definition/wordpress:3"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0dcc26775dcf052d6",
            ]
          + subnets          = [
              + "subnet-0c87dfef08f53a968",
              + "subnet-0d54284d694defe07",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "arn:aws:servicediscovery:us-east-1:816069151329:namespace/ns-os4u4zahbptsybf5"

          + service {
              + discovery_name = "wordpress"
              + port_name      = "php-fpm"

              + client_alias {
                  + port = 9000
                }
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ravenoak, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*